

def taskFirst():
    """
    ЛАБОРАТОРНА РОБОТА №1
    ОСНОВИ МОВИ PYTHON
    """

    # ОГОЛОШЕННЯ ЗМІННИХ
    var1 = int(input("\n Введіть 1 значення: "))
    var2 = int(input("\n Введіть 2 значення: "))
    var3 = float(input("\n Введіть 3 значення: "))
    var4 = float(input("\n Введіть 4 значення: "))

    # ДОДАВАННЯ
    sum_1_2 =  var1 + var2
    sum_3_4 =  var3 + var4

    # ВІДНІМАННЯ
    sub_1_2 = var1 - var2
    sub_3_4 = var3 - var4

    # МНОЖЕННЯ
    mul_1_2 = var1 * var2
    mul_3_4 = var3 * var4

    # ДІЛЕННЯ
    div_1_2 = var1 / var2
    div_3_4 = var3 / var4

    # ПІДНЕСЕННЯ ДО СТУПЕНЯ
    deg_1_2 = var1 ** var2
    deg_3_4 = var3 ** var4

    # ЦІЛОЧИСЕЛЬНЕ ДІЛЕННЯ
    intDiv_1_2 = var1 // var2
    intDiv_3_4 = var3 // var4

    # ОСТАЧА ВІД ДІЛЕННЯ
    remOfDiv_1_2 = var1 % var2
    remOfDiv_3_4 = var3 % var4

    # ОГОЛОШЕННЯ МАССИВУ З РЕЗУЛЬТАТАМИ ОПЕРАЦІЙ
    arrayOfResults = [sum_1_2, sum_3_4,
                      sub_1_2, sub_3_4,
                      mul_1_2, mul_3_4,
                      div_1_2, div_3_4,
                      deg_1_2, deg_3_4,
                      intDiv_1_2, intDiv_3_4,
                      remOfDiv_1_2, remOfDiv_3_4
                     ]

    # ВИВІД РЕЗУЛЬТАТІВ
    print(
        "\n \\---------------------ВИВІД---------------------//" +
        "\n\n Додавання цілих чисел : " + str(sum_1_2) +
        "\n\n Додавання чисел з плаваючою комою : " + str(sum_3_4) +
        "\n\n Віднімання цілих чисел : " + str(sub_1_2) +
        "\n\n Віднімання чисел з плаваючою комою : " + str(sub_3_4) +
        "\n\n Множення цілих чисел : " + str(mul_1_2) +
        "\n\n Множення чисел з плаваючою комою : " + str(mul_3_4) +
        "\n\n Ділення цілих чисел : " + str(div_1_2) +
        "\n\n Ділення чисел з плаваючою комою : " + str(div_3_4) +
        "\n\n До ступеня цілих чисел : " + str(deg_1_2) +
        "\n\n До ступеня чисел з плаваючою комою : " + str(deg_3_4) +
        "\n\n Ціле ділленя цілих чисел : " + str(intDiv_1_2) +
        "\n\n Ціле ділленя чисел з плаваючою комою : " + str(intDiv_3_4) +
        "\n\n Залишок від ділення цілих чисел : " + str(remOfDiv_1_2) +
        "\n\n Залишок від ділення чисел з плаваючою комою : " + str(remOfDiv_3_4)
    )

    # ОГОЛОШЕННЯ ЗМІННОЇ ДЛЯ З ІМЕНЕМ ТА ПРІЗВИЩЕМ
    firstName = str(input("\n Введіть ваше Ім'я: "))
    lastName = str(input("\n Введіть ваше Прізвище: "))
    name = lastName + " " + firstName

    # ВИВІД ВИСНОВКУ ПО ЛАБОРАТОРНІЙ РОБОТІ
    print(
        "\n \\---------------------ВИСНОВОК---------------------//" +
        "\n\n Під час вииконання цієї лабораторної роботи я " + name + " створив 4 змінні двом з яких я присвоїв цілий тип данних а двом іншим з плаваючою комою." +
        "\n Далі я створив по дві змінні на кожну операції (для цілих та дробових чисел), ці змінні я додав у массив з рузультатами та вивів змінні з результатами у термінал."
    )

    return "end"