import random

def taskFourth():

    # ОГОЛОШУЄМО ПУСТИЙ МАССИВ
    randomNumberArray = []

    # ФУНКЦІЯ ДЛЯ ЗАПОВНЕННЯ МАСИВУ РАНДОМНИМИ ЧИСЛАМИ
    def appendingFunc(array):
        for i in range(30):
            array.append(random.randint(-100, 100))

    # ВИКЛИК ФУНКЦІЇ ЗАПОВНЕННЯ
    appendingFunc(randomNumberArray)

    # ФУНКЦІЯ З СОРТУВАННЯМ БУЛЬБАШКОЮ
    def bubbleSort(array):

        # ОГОЛОШЕННЯ ФЛАЖКА З СВАПОМ ДЛЯ ПОВТОРНОГО ВИКОРИСТАННЯ
        swapped = False

        # БЕРЕМО ДОВЖИНУ З ПЕРЕДАНОГО МАССИВУ
        n = len(array)

        # ПЕРШИЙ ЦИКЛ З ПЕБОРОМ МАССИВУ
        for i in range(n-1):

            # ДРУГИЙ ЦИКЛ
            for j in range(0, n-i-1):

                # УМОВА ЧИ j-ТИЙ ЕЛЕМЕНТ БІЛЬШИЙ ЗА НАСТУПНИЙ
                if array[j] > array[j + 1]:

                    # ЗМІНЮЄМО ФЛАЖОК
                    swapped = True

                    # ЯКЩО НАСТУПНИЙ ЕЛЕМЕНТ БІЛЬШИЙ ЗА j-ТИЙ ТОДІ ЗМІНЮЄМО ЇХ
                    array[j], array[j + 1] = array[j + 1], array[j]

            # ЯКЩО ЗАМІНА НЕ ПОТРІБНА ВИХОДИМО З ЦИКЛУ
            if not swapped:
                return

    # ВИКЛИКАЄМО ФУНКЦІЮ З СОРТУВАННЯМ ТА ПІДСТАВЛЯЄМО НАШ МАССИВ
    bubbleSort(randomNumberArray)

    # ВИКЛИКАЄМО ЦИКЛ З ПЕРЕБОРОМ НАШОГО ВІДСОРТОВАНОГО МАССИВУ
    print(
        "\n"+"\\---------------------ЛАБОРАТОРНА РОБОТА №4---------------------//\n"
    )
    print("\\---------------------ВИВІД---------------------//\n")
    for k in range(len(randomNumberArray)):
        print(randomNumberArray[k])

    print(
        "\n \\---------------------ВИСНОВКИ---------------------//" +
        "\n\nПід час виконання цієї лабораторної роботи я користувався бібліотекою взяття використання рандомних значень."+
        "\nПісля я додав їх у мвссив та застосував сортування бульбашкою для його перебору."
    )

    return randomNumberArray